[
  {
    "id": "breads",
    "name": "Breads",
    "description": "Handcrafted small-batch Sourdough, French, and Italian breads. Enjoy our artisanal loaves, custom orders, and fresh dinner rolls, made with care and the finest ingredients.",
    "icon": "Croissant",
    "items": [
      {
        "name": "White Sourdough",
        "description": "Classic White Sourdough",
        "price": "JOD 6"
      },
      {
        "name": "Whole Wheat Sourdough",
        "description": "100% Whole Wheat flour",
        "price": "JOD 6"
      },
      {
        "name": "Artisanal Loaf Sourdough",
        "description": "Specialty blend of grains flours",
        "price": "JOD 6"
      },
      {
        "name": "100%  Rye Sourdough",
        "description": "Russian Rye Flour and Caraway Seeds",
        "price": "JOD 6"
      },
      {
        "name": "MultiSeed Whole Grain Sourdough",
        "description": "With a blend of Pumpkin, Sesame, Sunflower, poppy and Black Seeds",
        "price": "JOD 7"
      },
      {
        "name": "Brioche Loaf",
        "description": "Classic, Variations include: Chocolate chip, Raisin & walnut, Apple Cinnamon",
        "price": "JOD 7  JOD 8"
      },
      {
        "name": "Cinnamon Swirl Bread",
        "description": "Buttery with a swirl of Cinnamon Sugar",
        "price": "JOD 7"
      },
      {
        "name": "Ciabatta",
        "description": "Classic Italian Bread with a chewy crust and open crumbs",
        "price": "JOD 4"
      },
      {
        "name": "Focaccia",
        "description": "Classic Herb, Tomato Feta and Basil, Black and Green Olive, Sausage and Cheddar, and Caramelized Onions, Mushroom and Goat Cheese",
        "price": "JOD 7"
      }
    ]
  },
  {
    "id": "cookies-bars",
    "name": "Cookies, Bars & Brownies",
    "description": "Indulge in our timeless classics, as well as custom creations tailored just for you. We introduce exciting new flavors every month, with seasonal updates to keep things fresh. Be sure to check back often for the latest treats!",
    "icon": "Cookie",
    "items": [
      {
        "name": "Best Chocolate Chip Cookies",
        "description": "",
        "price": "JOD 3"
      },
      {
        "name": "Dark Chocolate Peanut Butter Chip",
        "description": "",
        "price": "JOD 3"
      },
      {
        "name": "Oatmeal Raisin",
        "description": "With plump Black and Golden Raisins",
        "price": "JOD 3"
      },
      {
        "name": "Lemon Drop",
        "description": "Zesty with White Chocolate Chips",
        "price": "JOD 3"
      },
      {
        "name": "Samoa Cookie",
        "description": "Caramel Coconut Chocolate Chip",
        "price": "JOD 3"
      },
      {
        "name": "Stamped Sugar Cookies",
        "description": "Almond and Honey",
        "price": "JOD 3"
      },
      {
        "name": "Ginger Cookies",
        "description": "Ginger, spice and everything nice",
        "price": "JOD 3"
      },
      {
        "name": "Red Velvet Macadamia",
        "description": "Chewy and crunchy with a hint of cocoa",
        "price": "JOD 3"
      },
      {
        "name": "Limoncello Cheesecake Bars",
        "description": "Citrusy and creamy",
        "price": "JOD 3"
      },
      {
        "name": "Strawberry Crumble",
        "description": "Soft chewy center with a crunch Streusel topping",
        "price": "JOD 4"
      },
      {
        "name": "Millionaire Shortbread",
        "description": "Classic buttery Shortbread with Caramel Center and Chocolate Frosting",
        "price": "JOD 4"
      },
      {
        "name": "GF Chocolate Chip",
        "description": "Gluten-free version of the classic favorite",
        "price": "JOD 4"
      },
      {
        "name": "Brownie with Tahini Swirls",
        "description": "With Halava bits",
        "price": "JOD 4"
      },
      {
        "name": "Classic Brownie",
        "description": "With All Valrohna Chocolate chip and cocoa",
        "price": "JOD 4"
      },
      {
        "name": "Blondies",
        "description": "With toasted pecans",
        "price": "JOd 4"
      },
      {
        "name": "Matcha Brownie",
        "description": "With White Chocolate Chips",
        "price": "JOD 4"
      },
      {
        "name": "Red Velvet and Cream Cheese Brownies",
        "description": "Light chocolate with a slight of tang",
        "price": "JOD 4"
      }
    ]
  },
  {
    "id": "cakes-cupcakes",
    "name": "Cakes, Cheesecakes & Cupcakes",
    "description": "From classic favorites to inventive seasonal creations, our cakes, cheesecakes, and cupcakes are made to delight. Any cake flavor can be made into cupcakes, and we happily take custom orders. New flavors are added monthly—check back often to see what’s fresh from the oven!",
    "icon": "CakeSlice",
    "items": [
      {
        "name": "Tiered Cakes",
        "description": "Tailored Layer Cake (Check with us), 12 Layer Chocolate Cake, Strawberry, Banana Toffee, Birthday Cake Funfetti, Coconut, Lotus Chocolate, Olive Oil Lemon Basil. ",
        "specs": [
          "Each cake features three or more generous layers, filled and topped with a variety of premium ingredients.",
          "Signature flavors include Red Velvet, Carrot, Banana, Coffee, and Lemon.",
          "Fillings range from timeless to indulgent: Vanilla Bean Custard, Strawberry, Raspberry, Blueberry compote, Caramel, Chocolate, Banana Mousse, Lemon Curd, Coffee Cream, Oreo, Lotus, and seasonal favorites like Passion fruit, Mango, Peach, and more.",
          "Our house-made frostings includes but not limited to French buttercream in Vanilla, Chocolate, White Chocolate, Salted Caramel, Mocha, and Lotus.",
          "Additional frosting options include Cream Cheese, Marshmallow, Whipped Cream, Ganache."
        ]
      },
      {
        "name": "Bundt and Coffee Cakes",
        "description": "Sour Cream Pound Cake, Vanilla Chocolate Marble Cake, Lemon Pound Cake with Lemon Curd, Spiced Coffee with Streusel Toppings."
      },
      {
        "name": "Crepe Cakes",
        "description": "Tiramisu, Matcha, Crème Brûlée, Milk Tea, Chocolate Mocha"
      },
      {
        "name": "Cupcakes & Muffins",
        "description": "Custard Castella, Chocolate Espresso Cream, Rosemary Orange, Lemon Blueberry, Multigrain Health, Apple Granola, Ginger Orange Crunch"
      },
      {
        "name": "Cheesecake",
        "description": "Baked, No-Bake Cheesecake, and  Burnt Basque Cheesecake  served with a variety of toppings as Strawberry Compote, Blueberry Compote, Raspberry Compote, Salted Caramel, Chocolate Sauce, Seasonal Fruit Compote, Dulce De Leche"
      }
    ]
  },
  {
    "id": "brunch",
    "name": "Brunch",
    "description": "Our brunch menu brings together comforting classics and savory delights made from scratch. From fluffy quiches and loaded egg bakes to herb-scented biscuits and crêpes, each dish is crafted with care and rich flavors. Customize your plate with a variety of fillings, sauces, and seasonal ingredients—perfect for leisurely mornings and hearty appetites.",
    "icon": "EggFried",
    "items": [
      {
        "name": "Quiche",
        "description": "Lorraine: Bacon and Swiss, Mediterranean:Tomato Basil and Feta, French: Mushroom and Goat Cheese",
        "price": ""
      },
      {
        "name": "Egg Bake Casserole",
        "description": "Potato Strata topped with eggs, and fillings including: Mushrooms, Sausage, veggies, and Cheeses. Sauces include: Black Peppercorn Gravy, Ranchero, Hollandaise and more.",
        "price": ""
      },
      {
        "name": "Home Fries",
        "description": "Crispy oven baked Potatoes with roasted garlic and herbs. Add cheese, baccon and veggies : Onions, Mushrooms and peppers.",
        "price": ""
      },
      {
        "name": "Savory Egg Crêpe",
        "description": "Filled with eggs, and cheese, extra fillings include: Sausage, mushrooms, chicken, and veggies",
        "price": ""
      },
      {
        "name": "Savory Herb Scone",
        "description": "Parmesan and chive scone served warm",
        "price": ""
      },
      {
        "name": "Buttermilk Biscuits",
        "description": "Classic, Cheese, Roasted Garlic and Herb, Bacon and Cheddar.",
        "price": ""
      }
    ]
  },
  {
    "id": "pies-galettes",
    "name": "Pies, Cobblers & Galettes",
    "description": "Our pies, cobblers, and galettes celebrate the richness of seasonal fruit and timeless comfort. From buttery lattice-topped pies to rustic open-faced galettes and bubbling cobblers with golden biscuit crusts, each treat is made by hand with love and premium ingredients. Ask us about custom fillings and rotating seasonal specials!",
    "icon": "PieChart",
    "items": [
      {
        "name": "Rustic Seasonal Galette",
        "description": "Free-form tart with options like cinnamon apples, grilled peaches with burrata, or stone fruits.",
        "price": ""
      },
      {
        "name": "Berry Cobbler",
        "description": "Mixed seasonal berries baked with vanilla biscuit topping.",
        "price": ""
      },
      {
        "name": "Pecan Pie",
        "description": "Toasted pecans in a rich brown sugar custard with flaky pie crust.",
        "price": ""
      },
      {
        "name": "Pumpkin Pie",
        "description": "Pumpkin in a rich butternut custard with flaky pie crust.",
        "price": ""
      },
      {
        "name": "Chocolate Cream Pie",
        "description": "Rich chocolate custard in a flaky pie crust with whipped cream and chocolate shavings",
        "price": ""
      },
      {
        "name": "Apple Pie",
        "description": "Classic apple pie with flaky crust and spiced apple filling.",
        "price": ""
      },
      {
        "name": "Banoffie Pie",
        "description": "Banana, toffee, and whipped cream in a graham cracker crust.",
        "price": ""
      },
      {
        "name": "Lemon Meringue Pie",
        "description": "Tart and creamy lemon custard in a flaky pie crust with toasted meringue.",
        "price": ""
      },
      {
        "name": "Peach Cobbler",
        "description": "Fresh peaches baked with vanilla biscuit topping.",
        "price": ""
      }
    ]
  },
  {
    "id": "bamboloni",
    "name": "Bamboloni",
    "icon": "Doughnut",
    "description": "Our Bamboloni are handcrafted Italian doughnuts made from enriched brioche dough for an irresistibly soft, airy texture. Each one is filled with decadent creams, curds, or jams and finished with unique coatings for a perfect bite. We also offer custom flavors and seasonal varieties to keep things deliciously fresh.",
    "items": [
      {
        "name": "Crème brûlée",
        "description": "Filled with French pastry cream with a burnt sugar crunch",
        "price": ""
      },
      {
        "name": "Chocolate",
        "description": "Filled with chocolate pastry cream and coated with cocoa powder and sugar",
        "price": ""
      },
      {
        "name": "Café Latte",
        "description": "Filled with coffee cream",
        "price": ""
      },
      {
        "name": "Mexicano",
        "description": "Filled with dulce de leche and coated with cinnamon sugar",
        "price": ""
      },
      {
        "name": "Thai Dream",
        "description": "Filled with coconut cream, mango mousse and coated with toasted coconut",
        "price": ""
      },
      {
        "name": "Strawberry",
        "description": "Filled with strawberry jam and pastry cream",
        "price": ""
      },
      {
        "name": "Lemon",
        "description": "Filled with lemon curd and topped with toasted marshmallow",
        "price": ""
      }
    ]
  }
]